Tekla.Structures.ModelInternal.ICDelegate.ExportCreatePart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByParts(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
Part1Id:
Part2Id:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)
DO NOT USE! For internal usage only!
pPart1Id:
pPart2Id:
pFace1:
pFace2:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBentPlateRadius(System.Int32,System.Int32,System.Double)
DO NOT USE! For internal usage only!
PartId:
GeometryNodeId:
Radius:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCalculateContourPolygon(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)
DO NOT USE! For internal usage only!
pContour:
pPolygon:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifySurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCleanDrawingFiles(System.Boolean,System.String)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportDisplayPrompt(System.String)
DO NOT USE! For internal usage only!
Message:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.EditMacro(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.StartMacroRecording(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.StopMacroRecording
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.RefreshMacroList
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.IsMacroRecording
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportInsertView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
View:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRebarSetFunction(Tekla.Structures.ModelInternal.RebarSetAction,Tekla.Structures.ModelInternal.dotRebarSet_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportRebarSetAdditionFunction(Tekla.Structures.ModelInternal.RebarSetAction,Tekla.Structures.ModelInternal.dotRebarSetAddition_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLegFace(Tekla.Structures.ModelInternal.dotLegFace_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectLegFace(Tekla.Structures.ModelInternal.dotLegFace_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateGuideline(Tekla.Structures.ModelInternal.dotGuideline_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectGuideline(Tekla.Structures.ModelInternal.dotGuideline_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectSurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifySurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
